import React, { useState } from 'react';
import Navbar from '../components/_App/Navbar';
import PageBanner from '../components/Common/PageBanner';
import Subscribe from '../components/Common/Subscribe';
import Footer from '../components/_App/Footer'; 
import dynamic from 'next/dynamic';;
import { useRouter } from 'next/router'

const OwlCarousel = dynamic(import('react-owl-carousel3'));

const options = {
    loop: true,
    nav: false,
    dots: true,
    autoplayHoverPause: true,
    autoplay: true,
    autoplayTimeout: 2500, 
    items: 1,
    animateOut: 'fadeOut',
    margin: 0,
};

const consultingservices = () => {
   
    const [display, setDisplay] = React.useState(false);
    const router = useRouter();
    const data = router.query;
    const [Paragraph,setparagraph] = useState('')
    const [Title,setTitle] = useState('')
    const [SubTitle,setSubTitle] = useState('')
    const [SubTitles,setSubTitles] = useState('')
    React.useEffect(() => {
        console.log('data',data.data)
        setDisplay(true);
        if(data.data == 1)
        {
            setTitle('مشاوره بیمه و تامین اجتماعی')
        setparagraph(
            <>
            <p>بیمه یکی از آشنا ترین واژه‌هاییست که هر روزه در ادبیاتمان از آن سخن می‌گوییم و به یک مسئله عام و فراگیر هم تبدیل شده است. بیمه درحقیقت یک قرارداد حقوقی بین شما و یک شرکت بیمه (بیمه‌گر) است که بر اساس آن شرکت بیمه متعهد می شود در صورت وقوع حادثه و بیماری و ازکارافتادگی خسارت واردشده به شما را تا سقف مشخصی که در بیمه‌نامه تعیین شده، جبران کند. به طور کلی بیمه‌ها اعم از بیمه اتومبیل و مسافرت یا بازنشستگی و عمر و حتی بیمه‌های درمانی و تکمیلی در سه دسته بیمه اشخاص، بیمه اموال و بیمه مسئولیت تقسیم‌بندی می‌شوند. </p>
            <p> اکثر افراد اطلاعات چندانی درباره بیمه و انواع آن ندارند. با این حال، قوانین بیمه‌ای و پوشش‌های بیمه‌نامه‌ها یک جنبه مهم از رفاه مالی  شما محسوب می‌شود و داشتن سیاست‌های مناسب و به‌صرفه می‌تواند تأثیر جدی بر زندگی شما داشته باشد. از طرف دیگر هیچ بیمه‌نامه واحدی وجود ندارد که تمام جنبه‌های خطرات و حوادث تهدید کننده زندگی شما را پوشش بدهد. بنابراین، اگر می‌خواهید درصورت بروز حادثه، بیماری، کارافتادگی، بازنشستگی و … از بروز مشکلات مالی عمده  برای خود و خانواده و عزیزانتان جلوگیری کنید، به انواع مختلفی از پوشش نیاز خواهید داشت. پس مهم است که اطلاعات هرچند اندک اما کافی درباره بیمه و اهمیت آن، انواع و مزایای بیمه‌های مختلف داشته باشید. </p>
            <p>مشاوره بیمه از آن جا یک امر ضروری است که ما با سلسله بیمه‌هایی روبه رو هستیم که ممکن است یکی بر دیگری ارجح باشد. برای مثال احتمالا در خصوص انواع بیمه‌های عمر شنیده‌اید. تبلیغات گسترده‌ای در این زمینه صورت می‌گیرد اما بهترین نوع بیمه عمر کدام است؟ چگونه می‌توان در آن سرمایه گذاری کرد؟ چه شرایطی دارد؟ چه تضمینی برای پرداخت مبالغ بازنشستگی وجود دارد؟ آیا می‌توان در کوتاه مدت هم بازنشسته شد؟ این‌ها سوالاتی است که مشاور بیمه به آن پاسخ می‌دهد و همه افرادی که اقدام به بیمه کردن خود می‌کنند مایل اند تا ابتدا در خصوص آن مطالب موثقی بخوانند و یا بشنود.</p>
            {/* <p>بیمه ایم؛ شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.</p> */}
            </>
            )
            setSubTitle(<p>
                 شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
            </p>)
            setSubTitles('بیمه ایم')
        }
        else if(data.data ==2 )
        {
            setTitle('مشاوره امور حقوقی')
            setparagraph(
                <>
                <p>مشاوره گرفتن از متخصصین برای آگاهی در اموری که به آنها اطلاع یا اشرافی نداریم امری پسندیده است که توسط هر شهروندی که به اصل “پیشگیری بهتر از درمان” اعتقاد و ایمان دارد توصیه می شود. بسیاری از مشکلات و دردسرهایی که اشخاص با آن مواجه می شوند به این دلیل است که در مواجه با یک موضوع تخصصی مثلاً در مسائل حقوقی، از نظرات افراد آگاه به عنوان " مشاور حقوقی" بهره نگرفته اند. همۀ ما شنیده ایم دردِ دل افرادی که ابراز پشیمانی کردند از اینکه چرا در مواجه ی با دعوا یا مسأله و سوال حقوقی بی تفاوت از کنار آن گذشتند و به دنبال پاسخی برای آن نرفتند و  بسیار شاهد کسانی بودیم که علی رغم اینکه محق بودند ولی با بی توجهی یا کم توجهی به حق خود و نگرفتن مشاوره برای انجام اقدامات درست و به موقع، هیچ وقت به حق پایمال شده ی خود نرسیدند.</p>
                <p> مشاور حقوقی "، حقوقدانی است که در مسایل حقوقی علم، تخصص، تجربه و آگاهی دارد و ما برای گرفتن مشورت و راهنمایی جهت مواجه نشدن یا حل کردن مشکلات و مسائل حقوقی که در برخی موارد با سختی و هزینه های زیاد قابل جبران است نزد او می رویم. </p>
                <p>مشاوره حقوقی به شما این امکان را می‌دهد، از قانونی که برای حل اختلاف یا برطرف کردن مسئله‌ای وضع شده است به نحوی صحیح و مطلوب استفاده کنید. بدون کارشناس حقوقی و وکیل استفاده از قوانین دشوار و حتی غیرممکن است زیرا قوانین با ادبیاتی حقوقی نگاشته شده و استفاده از آن‌ها نیاز به مهارت و تخصصی دارد که مشاوران حقوقی و وکلا از آن برخوردارند.</p>
                </>
            )
            setSubTitle(<p>
                 شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور حقوقی بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
            </p>)
             setSubTitles('وکیلان')
        }
        else if(data.data==3)
        {
            setTitle('مشاوره امور مالیاتی')
            setparagraph(
                <>
                <p> بسیاری از صاحبان کسب و کارها بر این باورند که با انجام کارها توسط خودشان بهتر میتوانند پول و منابع را حفظ کنند اما واقعا چنین نیست. قوانین مالیاتی به طور مداوم در حال تغییر هستند و پیگیری این تغییرات برای افراد عادی بسیار دشوار است. عدم تسلط به قوانین مالیاتی باعث میشود تا خطر اشتباهات مالیاتی و مدیریت نامناسب مسائل مالیاتی افزایش یابد. یک مشاور خبره میتواند با تسلط به این قوانین و آگاهی از قوانین جدید کمک بزرگی به بهره مندی از قوانین کند. همچنین گاهی به علت نداشتن آگاهی کافی از قوانین ممکن است نتوانید به خوبی از مزیت های مالیاتی و روش های تخفیف قانونی آن بهره مند شوید.</p>
                <p>
                مالیات و بیمه دو حلقه اساسی در هر کسب وکار را تشیکل میدهند که بسیاری از مدیران شرکتها را وادار میکنند تا از خدمات یک وکیل مالیاتی یا بیمه استفاده کنند. حتی برخی از شرکتها برای خود یک مشاور مالیاتی استخدام میکنند. قوانین و مقررات پیچیده در کنار فرایندهای طوالنی اداری و بروکراسی شدید باعث شده تا افراد معمول با مشکلات ریز و درشت مختلفی در این زمینه مواجه شوند. بسیاری از کسب وکارها دچار جریمه های سنگین مالیاتی میشوند و برخی دیگر نیز هنوز در ابتدای راه بوده و اطلاعی از ساز وکارهای مالیاتی ندارند. شرکتها در بسیاری از اوقات با استخدام حسابداران حرفه ای تلاش میکنند تا از مشکلات مالیاتی خود بکاهند. اما غالبا باز هم در برخی مواقع حداقل نیاز به یک مشاوره مالیاتی تلفنی یا آنلاین دارند. با این حال، برخی دیگر از صاحبان کسب وکار تصمیم میگیرند از همان ابتدا امور مالی خود را به یک شرکت مشاوره مالیاتی برونسپاری کنند. هر کدام از این روشها مزایا و معایب خاص خود را دارند.
                </p>
                </>
            )
            setSubTitle(
                <p> شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور مالیاتی بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.</p>
            )
            setSubTitle(<p>
                شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
           </p>)
            setSubTitles('مالیاتچی')
        }
        else if(data.data==4)
        {
            setTitle('مشاوره تامین اجتماعی')
            setparagraph(
                <>
                <p>تأمین اجتماعی از حقوق بنیادین اعضای جامعه است که در قانون اساسی جمهوری اسلامی ایران از آن به‌ عنوان یکی از وظایف و تکالیف دولت تعبیر شده است. هم کارفرمایان و هم کارگران در طول حیات کاری خود قطعا با برخی مسائل روابط کار روبرو خواهند شد که در بسیاری موارد حل آنها نیازمند دریافت خدمات مشاوره بیمه کارگری و قانون کار است. مواردی که گاه می‌توان با گرفتن یک مشاوره آن را حل کرد تا آنکه کار به دعاوی حقوقی کارگری و کارفرمایی بکشد.</p>
                <p>صاحبان مشاغل اهمیت این موضوع را درک کرده و به خوبی می دانند که در صورت کسب اطلاعات کافی از مشاوران تامین اجتماعی می توانند رفاه و آسایش را برای کارکنان کسب و کار خود به همراه بیاورند. نیروی کار می تواند آینده کسب و کار را تحت شعاع قرار دهد. از این رو آسایش و رفاه کارکنان از اهمیت بسیار بالایی برخوردار است.</p>
                <p>مشاوره تامین اجتماعی به شما کمک می‌کند که از حوزه اختیارات و فعالیت‌هایی که بیمه ارائه می‌دهد اطلاعات دقیقی کسب کنید تا بدانید که در هنگام بیمه کارگری، پیمانکاری و . . . چه نکاتی را باید رعایت کنید و چه روشهای برای سهولت کارتان وجود دارد. تمامی اشخاص چه کارگر و چه کارفرما برای این‌که بتوانند بر طبق قانون کار از حقوق مطلع شوند و یا در هنگام بروز اختلاف بین آن‌ها راه حل آن را بیاموزند باید از خدمات مشاوره‌ای استفاده کنند.</p>
                </>
            )
            setSubTitle(<p>
                شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
           </p>)
            setSubTitles('بیمه ایم')
        }
        else if(data.data==5)
        {
            setTitle('مشاوره سرمایه گذاری')
            setparagraph(
                <>
                <p>بیمه یکی از آشنا ترین واژه‌هاییست که هر روزه در ادبیاتمان از آن سخن می‌گوییم و به یک مسئله عام و فراگیر هم تبدیل شده است. بیمه درحقیقت یک قرارداد حقوقی بین شما و یک شرکت بیمه (بیمه‌گر) است که بر اساس آن شرکت بیمه متعهد می شود در صورت وقوع حادثه و بیماری و ازکارافتادگی خسارت واردشده به شما را تا سقف مشخصی که در بیمه‌نامه تعیین شده، جبران کند. به طور کلی بیمه‌ها اعم از بیمه اتومبیل و مسافرت یا بازنشستگی و عمر و حتی بیمه‌های درمانی و تکمیلی در سه دسته بیمه اشخاص، بیمه اموال و بیمه مسئولیت تقسیم‌بندی می‌شوند. </p>
                <p> اکثر افراد اطلاعات چندانی درباره بیمه و انواع آن ندارند. با این حال، قوانین بیمه‌ای و پوشش‌های بیمه‌نامه‌ها یک جنبه مهم از رفاه مالی  شما محسوب می‌شود و داشتن سیاست‌های مناسب و به‌صرفه می‌تواند تأثیر جدی بر زندگی شما داشته باشد. از طرف دیگر هیچ بیمه‌نامه واحدی وجود ندارد که تمام جنبه‌های خطرات و حوادث تهدید کننده زندگی شما را پوشش بدهد. بنابراین، اگر می‌خواهید درصورت بروز حادثه، بیماری، کارافتادگی، بازنشستگی و … از بروز مشکلات مالی عمده  برای خود و خانواده و عزیزانتان جلوگیری کنید، به انواع مختلفی از پوشش نیاز خواهید داشت. پس مهم است که اطلاعات هرچند اندک اما کافی درباره بیمه و اهمیت آن، انواع و مزایای بیمه‌های مختلف داشته باشید. </p>
                <p>مشاوره بیمه از آن جا یک امر ضروری است که ما با سلسله بیمه‌هایی روبه رو هستیم که ممکن است یکی بر دیگری ارجح باشد. برای مثال احتمالا در خصوص انواع بیمه‌های عمر شنیده‌اید. تبلیغات گسترده‌ای در این زمینه صورت می‌گیرد اما بهترین نوع بیمه عمر کدام است؟ چگونه می‌توان در آن سرمایه گذاری کرد؟ چه شرایطی دارد؟ چه تضمینی برای پرداخت مبالغ بازنشستگی وجود دارد؟ آیا می‌توان در کوتاه مدت هم بازنشسته شد؟ این‌ها سوالاتی است که مشاور بیمه به آن پاسخ می‌دهد و همه افرادی که اقدام به بیمه کردن خود می‌کنند مایل اند تا ابتدا در خصوص آن مطالب موثقی بخوانند و یا بشنود.</p>
                <p>بیمه ایم؛ شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.</p>
                </>
            )
            setSubTitle(<p>
                شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
           </p>)
            setSubTitles('بیمه ایم')
        }
        else if(data.data==6)
        {
            setTitle('مشاوره کسب و کار')
            setparagraph(
                <>
                <p>بیمه یکی از آشنا ترین واژه‌هاییست که هر روزه در ادبیاتمان از آن سخن می‌گوییم و به یک مسئله عام و فراگیر هم تبدیل شده است. بیمه درحقیقت یک قرارداد حقوقی بین شما و یک شرکت بیمه (بیمه‌گر) است که بر اساس آن شرکت بیمه متعهد می شود در صورت وقوع حادثه و بیماری و ازکارافتادگی خسارت واردشده به شما را تا سقف مشخصی که در بیمه‌نامه تعیین شده، جبران کند. به طور کلی بیمه‌ها اعم از بیمه اتومبیل و مسافرت یا بازنشستگی و عمر و حتی بیمه‌های درمانی و تکمیلی در سه دسته بیمه اشخاص، بیمه اموال و بیمه مسئولیت تقسیم‌بندی می‌شوند. </p>
                <p> اکثر افراد اطلاعات چندانی درباره بیمه و انواع آن ندارند. با این حال، قوانین بیمه‌ای و پوشش‌های بیمه‌نامه‌ها یک جنبه مهم از رفاه مالی  شما محسوب می‌شود و داشتن سیاست‌های مناسب و به‌صرفه می‌تواند تأثیر جدی بر زندگی شما داشته باشد. از طرف دیگر هیچ بیمه‌نامه واحدی وجود ندارد که تمام جنبه‌های خطرات و حوادث تهدید کننده زندگی شما را پوشش بدهد. بنابراین، اگر می‌خواهید درصورت بروز حادثه، بیماری، کارافتادگی، بازنشستگی و … از بروز مشکلات مالی عمده  برای خود و خانواده و عزیزانتان جلوگیری کنید، به انواع مختلفی از پوشش نیاز خواهید داشت. پس مهم است که اطلاعات هرچند اندک اما کافی درباره بیمه و اهمیت آن، انواع و مزایای بیمه‌های مختلف داشته باشید. </p>
                <p>مشاوره بیمه از آن جا یک امر ضروری است که ما با سلسله بیمه‌هایی روبه رو هستیم که ممکن است یکی بر دیگری ارجح باشد. برای مثال احتمالا در خصوص انواع بیمه‌های عمر شنیده‌اید. تبلیغات گسترده‌ای در این زمینه صورت می‌گیرد اما بهترین نوع بیمه عمر کدام است؟ چگونه می‌توان در آن سرمایه گذاری کرد؟ چه شرایطی دارد؟ چه تضمینی برای پرداخت مبالغ بازنشستگی وجود دارد؟ آیا می‌توان در کوتاه مدت هم بازنشسته شد؟ این‌ها سوالاتی است که مشاور بیمه به آن پاسخ می‌دهد و همه افرادی که اقدام به بیمه کردن خود می‌کنند مایل اند تا ابتدا در خصوص آن مطالب موثقی بخوانند و یا بشنود.</p>
                <p>بیمه ایم؛ شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.</p>
                </>
            )
            setSubTitle(<p>
                شبکه متشکل از مشاوران برتر در حوزه های تخصصی امور بیمه بوده که شما میتوانید در سریعترین زمان و به بهترین روش ممکن برای رفع مشکلات یا مسائل خود با آنها مشورت کنید.
           </p>)
            setSubTitles('بیمه ایم')
        }

    }, [])
    return (
        <>
            <Navbar />

            <PageBanner 
                pageTitle={Title}
                homePageUrl="/" 
                homePageText="صفحه اصلی" 
                activePageText={Title}
                imgClass="bg-1" 
            />

            <div className="services-details-area ptb-100" style={{fontFamily:'Digikala'}}>
                <div className="container" style={{fontFamily:'Digikala'}}>
                    <div className="row">
                        <div className="col-lg-6">
                            <div className="services-img">
                                <img src="/img/service-details/service-details1.jpg" alt="Image" />
                            </div>
                        </div>

                        <div className="col-lg-6">
                            {display ? <OwlCarousel 
                                className="services-item-wrap owl-carousel owl-theme"
                                {...options}
                            >  
                                <div className="services-item">
                                    <img src="/img/service-details/service-details2.jpg" alt="Image" />
                                </div>
                                <div className="services-item">
                                    <img src="/img/service-details/service-details3.jpg" alt="Image" />
                                </div>
                                <div className="services-item">
                                    <img src="/img/service-details/service-details4.jpg" alt="Image" />
                                </div>
                            </OwlCarousel> : ''}
                        </div>
                    </div>

                    <div className="services-details-text" style={{fontFamily:'Digikala'}}>
                        <h2 style={{fontFamily:'Digikala'}}>{Title}</h2>
                    
                       {Paragraph}
                    </div>
                    
                    <div className="scrives-item-2 mt-4 " style={{fontFamily:'Digikala'}}>
                        <div className="row align-items-center">
                            <div className="col-lg-4">
                                <div className="services-img">
                                    <img src="/img/service-details/service-details5.jpg" alt="Image" />
                                </div>
                            </div>

                            <div className="col-lg-8">
                                <h3 style={{fontFamily:'Digikala'}}>{SubTitles}</h3>
                               {SubTitle}
                            </div>
                        </div>
                    </div>
                    
                    <div className="scrives-item-3 mt-4">
                        <div className="row align-items-center">
                            <div className="col-lg-6">
                                <div className="social">
                                    <ul className="social-link">
                                        <li>
                                            <a href="https://www.facebook.com/" target="_blank">
                                                <i className="bx bxl-facebook"></i>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://www.twitter.com/" target="_blank">
                                                <i className="bx bxl-twitter"></i>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://www.pinterest.com/" target="_blank">
                                                <i className="bx bxl-pinterest-alt"></i>
                                            </a>
                                        </li>
                                        <li>
                                            <a href="https://www.instagram.com/" target="_blank">
                                                <i className="bx bxl-instagram"></i>
                                            </a>
                                        </li>
                                    </ul>
                                </div>
                            </div>

                            <div className="col-lg-6">
                                <div className="share">
                                    <a href="#">
                                        <i className="bx bx-share-alt" style={{fontFamily:'Digikala'}}></i> اشتراک گذاری
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>

            <Subscribe />
            
            <Footer /> 
        </>
    )
}

export default consultingservices;